Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: A few screens deep into Settings — Settings > Help > a tutorial or FAQ, for instance — navigation could get confused and unexpectedly bounce you back out to Home instead of where you tapped. Fixed. Reported directly: double-tapping into a Help article could unexpectedly land back out at Home instead of opening the article.
ar: على بُعد بضع شاشات داخل الإعدادات — الإعدادات > المساعدة > درس تعليمي أو الأسئلة الشائعة، مثلًا — كان التنقل قد يرتبك ويعيدك بشكل غير متوقع إلى الرئيسية بدلًا من المكان الذي نقرت عليه. تم الإصلاح. أُبلغ عنه مباشرة: النقر المزدوج للدخول إلى مقالة مساعدة كان قد يعيدك بشكل غير متوقع إلى الرئيسية بدلًا من فتح المقالة.
de: Ein paar Bildschirme tief in den Einstellungen — etwa Einstellungen > Hilfe > ein Tutorial oder FAQ — konnte die Navigation durcheinandergeraten und dich unerwartet zurück zu Start bringen, statt dorthin, wo du hingetippt hattest. Behoben. Direkt gemeldet: Doppeltippen, um einen Hilfeartikel zu öffnen, konnte dich unerwartet zurück zu Start bringen, statt den Artikel zu öffnen.
el: Λίγες οθόνες μέσα στις Ρυθμίσεις — Ρυθμίσεις > Βοήθεια > ένα σεμινάριο ή Συχνές Ερωτήσεις, για παράδειγμα — η πλοήγηση μπορούσε να μπερδευτεί και να σας πετάξει απρόσμενα πίσω στην Αρχική αντί εκεί που πατήσατε. Διορθώθηκε. Αναφέρθηκε απευθείας: το διπλό πάτημα για είσοδο σε ένα άρθρο Βοήθειας μπορούσε να σας γυρίσει απρόσμενα πίσω στην Αρχική αντί να ανοίξει το άρθρο.
es: Unas pocas pantallas dentro de Configuración — Configuración > Ayuda > un tutorial o preguntas frecuentes, por ejemplo — la navegación podía confundirse y devolverte inesperadamente a Inicio en lugar de a donde tocaste. Solucionado. Reportado directamente: tocar dos veces para entrar en un artículo de Ayuda podía devolverte inesperadamente a Inicio en lugar de abrir el artículo.
fa: چند صفحه داخل تنظیمات — برای مثال تنظیمات > راهنما > یک آموزش یا سؤالات متداول — ممکن بود پیمایش دچار سردرگمی شود و به‌طور غیرمنتظره شما را به خانه برگرداند به‌جای جایی که لمس کرده بودید. برطرف شد. مستقیماً گزارش شد: دوبار ضربه زدن برای ورود به یک مقالهٔ راهنما ممکن بود به‌طور غیرمنتظره شما را به خانه برگرداند به‌جای باز کردن مقاله.
fr: Quelques écrans à l'intérieur des Réglages — Réglages > Aide > un tutoriel ou une FAQ, par exemple — la navigation pouvait s'emmêler et vous renvoyer de façon inattendue vers Accueil au lieu de l'endroit où vous aviez touché. Corrigé. Signalé directement : un double-tap pour entrer dans un article d'Aide pouvait vous ramener de façon inattendue à Accueil au lieu d'ouvrir l'article.
he: כמה מסכים בתוך ההגדרות — הגדרות > עזרה > מדריך או שאלות נפוצות, לדוגמה — הניווט היה עלול להתבלבל ולהחזיר אותך באופן בלתי צפוי לבית במקום למקום שבו הקשת. תוקן. דווח ישירות: הקשה כפולה לכניסה למאמר עזרה הייתה עלולה להחזיר אותך באופן בלתי צפוי לבית במקום לפתוח את המאמר.
hi: सेटिंग्स के अंदर कुछ स्क्रीन नीचे — जैसे सेटिंग्स > सहायता > कोई ट्यूटोरियल या सामान्य प्रश्न — नेविगेशन उलझ सकता था और अनपेक्षित रूप से आपको जहां टैप किया था उसके बजाय होम पर वापस भेज सकता था। ठीक कर दिया गया। सीधे रिपोर्ट किया गया: किसी सहायता लेख में डबल-टैप करने पर अनपेक्षित रूप से लेख खोलने के बजाय होम पर वापस पहुंच जाना हो सकता था।
id: Beberapa layar di dalam Pengaturan — Pengaturan > Bantuan > tutorial atau FAQ, misalnya — navigasi bisa jadi bingung dan tiba-tiba membawa Anda kembali ke Beranda alih-alih ke tempat yang Anda ketuk. Diperbaiki. Dilaporkan secara langsung: mengetuk dua kali untuk masuk ke artikel Bantuan bisa membawa Anda kembali tak terduga ke Beranda alih-alih membuka artikelnya.
it: Alcune schermate dentro le Impostazioni — Impostazioni > Assistenza > un tutorial o le FAQ, per esempio — la navigazione poteva confondersi e riportarti inaspettatamente a Home invece che dove avevi toccato. Risolto. Segnalato direttamente: toccare due volte per entrare in un articolo di Assistenza poteva riportarti inaspettatamente a Home invece di aprire l'articolo.
ja: 設定の中を数画面進んだところ——たとえば設定 > ヘルプ > チュートリアルやFAQなど——でナビゲーションが混乱し、タップした場所ではなく予期せずホームに戻されてしまうことがありました。修正済みです。直接報告いただきました。ヘルプ記事をダブルタップして開こうとすると、記事が開かれる代わりに予期せずホームに戻されてしまうことがありました。
ko: 설정 안쪽으로 몇 화면 들어간 곳 — 예를 들어 설정 > 도움말 > 튜토리얼이나 FAQ — 에서 탐색이 꼬여 탭한 곳 대신 예기치 않게 홈으로 튕겨 나갈 수 있었습니다. 수정되었습니다. 직접 신고되었습니다: 도움말 문서를 더블 탭하면 문서가 열리는 대신 예기치 않게 홈으로 돌아가는 경우가 있었습니다.
nl: Een paar schermen diep in Instellingen — bijvoorbeeld Instellingen > Help > een zelfstudie of FAQ — kon de navigatie in de war raken en je onverwacht terugsturen naar Home in plaats van naar waar je had getikt. Opgelost. Rechtstreeks gemeld: dubbeltikken om een Help-artikel te openen kon je onverwacht terugbrengen naar Home in plaats van het artikel te openen.
pl: Kilka ekranów w głąb Ustawień — na przykład Ustawienia > Pomoc > samouczek lub FAQ — nawigacja mogła się pogubić i nieoczekiwanie odesłać Cię z powrotem do Strony głównej zamiast tam, gdzie dotknąłeś. Naprawione. Zgłoszone bezpośrednio: dwukrotne dotknięcie, by wejść w artykuł pomocy, mogło nieoczekiwanie odesłać z powrotem do Strony głównej zamiast otworzyć artykuł.
pt: Algumas telas dentro de Configurações — Configurações > Ajuda > um tutorial ou FAQ, por exemplo — a navegação podia se confundir e te levar de volta inesperadamente para o Início em vez de para onde você tocou. Corrigido. Reportado diretamente: tocar duas vezes para entrar em um artigo de Ajuda podia te levar de volta inesperadamente ao Início em vez de abrir o artigo.
ru: На нескольких экранах вглубь Настроек — например, Настройки > Справка > руководство или частые вопросы — навигация могла запутаться и неожиданно отбрасывала вас обратно на Главную вместо того места, куда вы нажали. Исправлено. Сообщено напрямую: двойное нажатие для перехода в статью справки могло неожиданно вернуть вас обратно на Главную вместо открытия статьи.
sv: Några skärmar in i Inställningar — Inställningar > Hjälp > en genomgång eller vanliga frågor, till exempel — kunde navigeringen bli förvirrad och oväntat skicka dig tillbaka till Hem i stället för dit du tryckte. Åtgärdat. Rapporterat direkt: att dubbeltrycka för att öppna en hjälpartikel kunde oväntat skicka dig tillbaka till Hem i stället för att öppna artikeln.
th: ไม่กี่หน้าจอลึกเข้าไปในการตั้งค่า — เช่น การตั้งค่า > ความช่วยเหลือ > บทแนะนำหรือคำถามที่พบบ่อย — การนำทางอาจสับสนและพาคุณกลับไปที่หน้าหลักโดยไม่คาดคิดแทนที่จะไปยังจุดที่คุณแตะ แก้ไขแล้ว รายงานโดยตรง: การแตะสองครั้งเพื่อเข้าบทความช่วยเหลืออาจพากลับไปที่หน้าหลักโดยไม่คาดคิดแทนที่จะเปิดบทความ
tr: Ayarlar içinde birkaç ekran derinlikte — örneğin Ayarlar > Yardım > bir öğretici veya SSS — gezinme karışabilir ve dokunduğunuz yer yerine beklenmedik şekilde sizi Ana Sayfa'ya geri fırlatabilirdi. Düzeltildi. Doğrudan bildirildi: bir Yardım makalesine çift dokunmak, makaleyi açmak yerine beklenmedik şekilde sizi Ana Sayfa'ya geri götürebiliyordu.
uk: На кілька екранів углиб Налаштувань — наприклад, Налаштування > Довідка > посібник чи поширені запитання — навігація могла заплутатися й несподівано повертала вас на Головну замість місця, куди ви натиснули. Виправлено. Повідомлено напряму: подвійний дотик, щоб перейти до статті довідки, міг несподівано повернути вас на Головну замість відкриття статті.
vi: Đi sâu vài màn hình bên trong Cài đặt — ví dụ Cài đặt > Trợ giúp > một hướng dẫn hoặc câu hỏi thường gặp — điều hướng có thể bị rối và bất ngờ đưa bạn quay lại Trang chủ thay vì nơi bạn đã chạm. Đã khắc phục. Đã được báo cáo trực tiếp: nhấn đúp để vào một bài trợ giúp có thể bất ngờ đưa bạn quay lại Trang chủ thay vì mở bài viết.
zh_hans: 在"设置"中深入几屏之后——例如设置 > 帮助 > 某个教程或常见问题——导航可能会出错，意外地把你弹回"主页"，而不是你点按的地方。已修复。经直接报告：双击进入某篇帮助文章时，可能会意外地弹回"主页"，而不是打开该文章。

source: Tapping Read Transcript could open to "This item is no longer available" even when the episode's show notes had a transcript right there the whole time — the sheet could open a beat before the transcript text was actually ready, and gave up instead of waiting. Not tied to any particular episode's transcript; verified against several different ones, all formatted the same way. Fixed so the sheet always waits for the text to be ready before it opens. Reported directly.
ar: النقر على قراءة النص كان قد يفتح على "لم يعد هذا العنصر متاحًا" حتى عندما كانت ملاحظات الحلقة تحتوي على النص طوال الوقت — الورقة كانت قد تفتح قبل أن يصبح نص النص جاهزًا فعليًا بلحظة، فتستسلم بدلًا من الانتظار. غير مرتبط بنص أي حلقة معينة؛ تم التحقق من عدة حلقات مختلفة، كلها بنفس التنسيق. تم الإصلاح بحيث تنتظر الورقة دائمًا جاهزية النص قبل أن تفتح. أُبلغ عنه مباشرة.
de: Ein Tippen auf Transkript lesen konnte zu „Dieser Inhalt ist nicht mehr verfügbar" führen, selbst wenn die Shownotes der Episode die ganze Zeit ein Transkript enthielten — das Blatt konnte sich einen Moment öffnen, bevor der Transkripttext tatsächlich bereit war, und gab dann auf, statt zu warten. Nicht an ein bestimmtes Episoden-Transkript gebunden; anhand mehrerer verschiedener geprüft, alle gleich formatiert. Behoben, sodass das Blatt jetzt immer wartet, bis der Text bereit ist, bevor es sich öffnet. Direkt gemeldet.
el: Το πάτημα στο Ανάγνωση Απομαγνητοφώνησης μπορούσε να ανοίξει σε «Αυτό το στοιχείο δεν είναι πλέον διαθέσιμο» ακόμη κι όταν οι σημειώσεις του επεισοδίου είχαν απομαγνητοφώνηση εκεί όλη την ώρα — το φύλλο μπορούσε να ανοίξει μια στιγμή πριν το κείμενο είναι όντως έτοιμο, και τα παρατούσε αντί να περιμένει. Δεν σχετίζεται με κάποια συγκεκριμένη απομαγνητοφώνηση επεισοδίου· επαληθεύτηκε σε αρκετές διαφορετικές, όλες με την ίδια μορφοποίηση. Διορθώθηκε ώστε το φύλλο να περιμένει πάντα το κείμενο να είναι έτοιμο πριν ανοίξει. Αναφέρθηκε απευθείας.
es: Tocar Leer Transcripción podía abrir "Este contenido ya no está disponible" incluso cuando las notas del episodio tenían una transcripción ahí todo el tiempo — la hoja podía abrirse un instante antes de que el texto de la transcripción estuviera realmente listo, y se rendía en lugar de esperar. No relacionado con la transcripción de ningún episodio en particular; verificado con varios distintos, todos con el mismo formato. Solucionado para que la hoja siempre espere a que el texto esté listo antes de abrirse. Reportado directamente.
fa: ضربه زدن روی خواندن متن پیاده‌شده ممکن بود به "این مورد دیگر در دسترس نیست" باز شود، حتی زمانی که یادداشت‌های قسمت پادکست تمام مدت یک متن پیاده‌شده همان‌جا داشت — شیت ممکن بود یک لحظه قبل از آماده شدن واقعی متن باز شود و به‌جای منتظر ماندن، تسلیم شود. مربوط به متن پیاده‌شدهٔ قسمت خاصی نیست؛ در برابر چند قسمت مختلف بررسی شد که همگی به یک شکل قالب‌بندی شده بودند. برطرف شد تا شیت همیشه پیش از باز شدن منتظر آماده شدن متن بماند. مستقیماً گزارش شد.
fr: Toucher Lire la transcription pouvait afficher « Cet élément n'est plus disponible » même quand les notes de l'épisode contenaient bel et bien une transcription depuis le début — la feuille pouvait s'ouvrir un instant avant que le texte de la transcription soit réellement prêt, et abandonnait au lieu d'attendre. Non lié à la transcription d'un épisode en particulier ; vérifié sur plusieurs épisodes différents, tous formatés de la même façon. Corrigé pour que la feuille attende toujours que le texte soit prêt avant de s'ouvrir. Signalé directement.
he: הקשה על קריאת התמלול הייתה עלולה לפתוח ל"פריט זה כבר אינו זמין" גם כשהערות הפרק כללו תמלול שם לאורך כל הזמן — הגיליון היה עלול להיפתח רגע לפני שטקסט התמלול היה מוכן בפועל, וכך ויתר במקום לחכות. לא קשור לתמלול של פרק מסוים; נבדק מול כמה פרקים שונים, כולם בפורמט זהה. תוקן כך שהגיליון תמיד ממתין שהטקסט יהיה מוכן לפני שהוא נפתח. דווח ישירות.
hi: ट्रांसक्रिप्ट पढ़ें पर टैप करने से "यह आइटम अब उपलब्ध नहीं है" खुल सकता था, तब भी जब एपिसोड के शो नोट्स में हर समय एक ट्रांसक्रिप्ट मौजूद थी — शीट ट्रांसक्रिप्ट टेक्स्ट के वास्तव में तैयार होने से एक पल पहले खुल सकती थी, और इंतज़ार करने के बजाय हार मान लेती थी। यह किसी खास एपिसोड की ट्रांसक्रिप्ट से जुड़ा नहीं है; कई अलग-अलग एपिसोड पर जांचा गया, जो सभी एक जैसे फॉर्मेट में थे। अब ठीक कर दिया गया है ताकि शीट खुलने से पहले हमेशा टेक्स्ट के तैयार होने का इंतज़ार करे। सीधे रिपोर्ट किया गया।
id: Mengetuk Baca Transkrip bisa membuka "Item ini tidak lagi tersedia" bahkan ketika catatan acara episode itu sebenarnya sudah punya transkrip sejak awal — lembar itu bisa terbuka sesaat sebelum teks transkrip benar-benar siap, dan menyerah alih-alih menunggu. Tidak terkait dengan transkrip episode tertentu; diverifikasi terhadap beberapa episode berbeda, semuanya berformat sama. Diperbaiki agar lembar itu selalu menunggu teks siap sebelum terbuka. Dilaporkan secara langsung.
it: Toccare Leggi trascrizione poteva aprire "Questo elemento non è più disponibile" anche quando le note dell'episodio avevano una trascrizione proprio lì per tutto il tempo — il foglio poteva aprirsi un istante prima che il testo della trascrizione fosse davvero pronto, e si arrendeva invece di aspettare. Non legato alla trascrizione di un episodio specifico; verificato su diversi episodi, tutti formattati allo stesso modo. Risolto in modo che il foglio aspetti sempre che il testo sia pronto prima di aprirsi. Segnalato direttamente.
ja: 文字起こしを読むをタップすると、エピソードの概要にずっと文字起こしがあったにもかかわらず、「このアイテムは利用できなくなりました」と表示されてしまうことがありました——シートは文字起こしのテキストが実際に準備できる少し前に開いてしまい、待つ代わりに諦めてしまっていました。特定のエピソードの文字起こしに限った問題ではなく、同じ形式の複数の異なるエピソードで確認しました。テキストの準備が整うまでシートが必ず待ってから開くように修正しました。直接報告いただきました。
ko: 대본 읽기를 탭하면 에피소드 쇼노트에 처음부터 대본이 있었는데도 "이 항목을 더 이상 사용할 수 없습니다"가 열리는 경우가 있었습니다 — 시트가 대본 텍스트가 실제로 준비되기 한 박자 전에 열려서, 기다리는 대신 포기해버렸기 때문입니다. 특정 에피소드의 대본에 국한된 문제가 아니며, 동일한 형식의 여러 에피소드에서 확인되었습니다. 이제 시트가 열리기 전에 항상 텍스트가 준비될 때까지 기다리도록 수정했습니다. 직접 신고되었습니다.
nl: Tikken op Transcript lezen kon leiden tot "Dit item is niet meer beschikbaar", zelfs als de shownotes van de aflevering de hele tijd al een transcript bevatten — het paneel kon een fractie eerder openen dan de transcripttekst daadwerkelijk klaar was, en gaf het dan op in plaats van te wachten. Niet gebonden aan het transcript van een specifieke aflevering; geverifieerd bij verschillende afleveringen, allemaal in dezelfde opmaak. Opgelost zodat het paneel altijd wacht tot de tekst klaar is voordat het opent. Rechtstreeks gemeld.
pl: Dotknięcie Czytaj transkrypcję mogło otworzyć "Ten element nie jest już dostępny", nawet gdy notatki odcinka miały transkrypcję cały czas dostępną — arkusz mógł otworzyć się chwilę przed tym, zanim tekst transkrypcji był naprawdę gotowy, i poddawał się zamiast czekać. Niezwiązane z transkrypcją konkretnego odcinka; zweryfikowane na kilku różnych, wszystkich sformatowanych tak samo. Naprawione tak, aby arkusz zawsze czekał na gotowość tekstu przed otwarciem. Zgłoszone bezpośrednio.
pt: Tocar em Ler transcrição podia abrir "Este item não está mais disponível" mesmo quando as notas do episódio tinham uma transcrição ali o tempo todo — a folha podia abrir um instante antes de o texto da transcrição estar realmente pronto, e desistia em vez de esperar. Não ligado à transcrição de nenhum episódio específico; verificado em vários episódios diferentes, todos formatados da mesma forma. Corrigido para que a folha sempre espere o texto ficar pronto antes de abrir. Reportado diretamente.
ru: Нажатие на Читать расшифровку могло открыть «Этот материал больше не доступен», даже когда в заметках эпизода расшифровка присутствовала всё это время — лист мог открыться на долю секунды раньше, чем текст расшифровки был действительно готов, и сдавался вместо того, чтобы подождать. Не связано с расшифровкой какого-то конкретного эпизода; проверено на нескольких разных, все в одинаковом формате. Исправлено так, чтобы лист всегда ждал готовности текста перед открытием. Сообщено напрямую.
sv: Att trycka på Läs transkription kunde öppna "Det här objektet är inte längre tillgängligt" även när avsnittets shownotes hade en transkription hela tiden — arket kunde öppnas ett ögonblick innan transkriptionstexten faktiskt var klar, och gav upp i stället för att vänta. Inte kopplat till transkriptionen för något särskilt avsnitt; verifierat mot flera olika, alla formaterade likadant. Åtgärdat så att arket alltid väntar på att texten ska bli klar innan det öppnas. Rapporterat direkt.
th: การแตะอ่านบทถอดเสียงอาจเปิดไปที่ "รายการนี้ไม่พร้อมใช้งานอีกต่อไป" แม้ว่าโน้ตประกอบตอนจะมีบทถอดเสียงอยู่ตรงนั้นตลอดเวลา — แผ่นอาจเปิดขึ้นก่อนที่ข้อความบทถอดเสียงจะพร้อมจริง ๆ เพียงเสี้ยววินาที แล้วยอมแพ้แทนที่จะรอ ไม่เกี่ยวข้องกับบทถอดเสียงของตอนใดตอนหนึ่งโดยเฉพาะ ได้ตรวจสอบกับหลายตอนที่แตกต่างกัน ซึ่งทั้งหมดจัดรูปแบบเหมือนกัน แก้ไขแล้วให้แผ่นรอข้อความพร้อมเสมอก่อนที่จะเปิด รายงานโดยตรง
tr: Metni Oku'ya dokunmak, bölümün program notlarında metin tüm zaman boyunca orada olsa bile "Bu öğe artık kullanılamıyor"u açabiliyordu — sayfa, metin gerçekten hazır olmadan bir an önce açılabiliyor ve beklemek yerine vazgeçiyordu. Belirli bir bölümün metnine bağlı değildi; aynı biçimde biçimlendirilmiş birkaç farklı bölümde doğrulandı. Sayfanın açılmadan önce her zaman metnin hazır olmasını beklemesi için düzeltildi. Doğrudan bildirildi.
uk: Натискання Читати текст могло відкрити «Цей матеріал більше не доступний», навіть коли у нотатках епізоду текст був присутній весь цей час — аркуш міг відкритися за мить до того, як текст справді був готовий, і здавався замість того, щоб чекати. Не пов'язано з текстом якогось конкретного епізоду; перевірено на кількох різних, усі в однаковому форматі. Виправлено так, щоб аркуш завжди чекав готовності тексту перед відкриттям. Повідомлено напряму.
vi: Chạm vào Đọc bản chép lời có thể mở ra "Mục này không còn khả dụng" ngay cả khi ghi chú tập podcast đã có sẵn bản chép lời suốt thời gian đó — trang có thể mở ra một khoảnh khắc trước khi văn bản bản chép lời thực sự sẵn sàng, và bỏ cuộc thay vì chờ đợi. Không liên quan đến bản chép lời của một tập cụ thể nào; đã xác minh trên nhiều tập khác nhau, tất cả đều có định dạng giống nhau. Đã khắc phục để trang luôn chờ văn bản sẵn sàng trước khi mở. Đã được báo cáo trực tiếp.
zh_hans: 点按"阅读文字稿"有时会打开"此内容已不再可用"，即便该期节目的节目说明里其实一直都有文字稿——面板可能会在文字稿文本真正准备好之前的一瞬间打开，于是它选择放弃而不是等待。这与某一期节目的文字稿无关；已针对多期格式相同的节目进行了验证。现已修复，面板会始终等文本准备好后再打开。经直接报告。
